{
    "LevelTask": {
        "level_1": "Собери максимальную выборку слизней",
        "level_2": "Минимизируй выборку",
        "level_3": "Мощности множеств категориальных признаков должны быть равны",
        "level_4": "t_value",
        "level_5": "t_value"
    },
    "LevelTheory": {
        "level_1": "Привет! Давай вспомним, что такое <important>математическая статистка</important>. Это раздел математики, в котором изучается множество тем, связанных с результатами наблюдения массовых случайных явлений. Например, <important>появление слизней</important> — такое явление. Все слизни вместе образуют <important>генеральную совокупность</important>, а часть отобранная для изучения — <important>выборочной совокупностью</important> (выборкой).\n\nМы не можем исследовать всех слизней, но можем часть. Давай призовем как можно большой слизней, чтобы максимизировать <important>объем</important> выборки, то есть число объектов совокупности.",
        "level_2": "<important>Объем выборки</important> стараются максимизировать, чтобы увеличить её <important>репрезентативность</important>, то есть то, как она отображает <important>генеральную совокупность</important>. Однако на ферме я разрешаю тебя уменьшать выборку, но <warning>нигде и никогда больше так не делай</warning>! \n\nБолее того, в дальнейшем мы будем вносить изменения в наши объекты, то есть манипулировать слизнями. <warning>С реальными объектами так делать нельзя</warning>.",
        "level_3": "У объектов есть <important>признаки</important>. Это результаты измерения некоторой <important>характеристики</important> объекта. Если множество значений признака конечно, то говорят, что он <important>категориальный</important>. Например, множество имён слизней конечно, поэтому имя — категориальный признак. \n\nДавай внесем небольшим изменения в нашу выборку, но напоминаю, что <warning>так можно делать только на ферме</warning>. \n\nNB. <important>Мощность множества</important> — количество элементов этого множества.",
        "level_4": "t_value",
        "level_5": "t_value"
    },
    "PythonHint": {
        "level_1": "t_value",
        "level_2": "t_value",
        "level_3": "t_value",
        "level_4": "t_value",
        "level_5": "t_value"
    },
    "TableHint": {
        "level_1": "t_value",
        "level_2": "t_value",
        "level_3": "t_value",
        "level_4": "t_value",
        "level_5": "t_value"
    },
    "ArenaTask": {
        "level_1": "Найди среднее значение сладкости",
        "level_2": "Найди среднее значение слизкости",
        "level_3": "t_value_3",
        "level_4": "t_value_4",
        "level_5": "t_value_5"
    },
    "UI": {
        "empty": "error",
        "btn_play": "играть",
        "btn_battle": "арена",
        "btn_exit": "выйти",
        "btn_change_language": "English",
        "btn_reset_progress": "сбросить прогресс",
        "hint_full": "больше нет...",
        "hint_deactivate": "не пролезает...",
        "hint_click_to_close": "нажми, чтобы закрыть",
        "slime_slipperiness": "слизкость: {0}",
        "slime_sweetness": "сладкость: {0}",
        "arena_description": "<important>Арена</important> — место, в котором ты можешь проверить свои силы. Это больше не площадка, тут с данными играться не получится. <warning>Теперь всё как в реальной жизни</warning>. Есть <important>выборка</important>, по ней требуется <important>что-то найти</important>. \n\nЗа каждый неправильный ответ ты будешь терять <warning>здоровье</warning>. Когда оно опустится до нуля, то… всё.",
        "arena_answer": "ответ..."
    }
}