{
    "LevelTask": {
        "level_1": "Попробуй собрать генеральную совокупность слизней",
        "level_2": "Собери максимальную выборку слизней",
        "level_3": "Минимизируй выборку",
        "level_4": "Оставь слизней толького того цвета, количество которых совпадает с числом признаков",
        "level_5": "Оставь слизня с уникальными значениями категориальных признаков",
        "level_6": "Оставь слизня с максимальной суммой количественных признаков",
        "level_7": "Сделай так, чтобы среднее слизкости было 15",
        "level_8": "Сделай так, чтобы среднее и медиана слизкости совпадали",
        "level_9": "Сделай так, чтобы признак \"цвет\" имел 5 мод",
        "level_10": ""
    },
    "LevelTheory": {
        "level_1": "Привет! Давай вспомним, что такое математическая статистика. Это раздел математики, изучающий результаты наблюдения массовых случайных явлений. Например, <important>появление слизней</important> — такое явление. Все слизни вместе образуют <important>генеральную совокупность</important>! Это такая совокупность, относительно которой мы будем делать какие-либо выводы. Давай попробуем собрать её.",
        "level_2": "Вместо генеральной совокупности давай соберем <important>выборку</important>. Часть <important>генеральной совокупности</important>, отобранная для изучения, называется <important>выборочной совокупностью</important>.",
        "level_3": "<important>Объем выборки</important> стараются максимизировать, чтобы увеличить её <important>репрезентативность</important>, то есть то, как она отображает <important>генеральную совокупность</important>. Однако на ферме я разрешаю тебе уменьшать выборку, но <warning>нигде и никогда больше так не делай</warning>!",
        "level_4": "У объектов есть <important>признаки</important>. Это результаты измерения некоторой <important>характеристики</important> объекта.",
        "level_5": "<important>Признаки</important> бывают разных типов. Если множество значений признака конечно, то говорят, что он <important>категориальный</important>. Например, множество типов слизней конечно, поэтому тип — категориальный признак.",
        "level_6": "Другой тип признака — <important>количественный</important>. В статистике чаще приходится сталкиваться именно с такими признаками, чем с <important>категориальными</important>. Он принимает любое значение числовой оси.",
        "level_7": "У признаков есть огромное число разных <important>характеристик</important>, например, <important>выборочное среднее</important>. Это просто среднее арифметическое значение <important>количественного</important> признака выборки. Давай поиграемся с данными, чтобы посмотреть, как меняется среднее.",
        "level_8": "Продолжим разбираться с <important>характеристиками</important>. Если есть <important>экстремальные значения</important>, то на помощь приходит <important>медиана</important>. \n\nМедиана равняется <important>середине упорядоченного ряда</important> значений признака (или на полусумму середины, если объем выборки четный). Иногда медиана и среднее могут совпадать. Давай попробуем так сделать!",
        "level_9": "Последняя <important>мера центральной тенденции</important> — <important>мода</important>. Это наиболее часто встречающее значение признака в выборке. Причём мод может быть <important>несколько</important>. Рассмотрим её на примере одного из <important>категориальных</important> признаков.",
        "level_10": ""
    },
    "LevelCompleted": {
        "level_1": "Конечно же, собрать всю <important>генеральную совокупность</important> просто <important>невозможно</important>, так как чаще всего она очень большая!",
        "level_2": "Вот с таким количеством работать уже реально! Сколько надо по факту, мы разберемся позже.",
        "level_3": "Напоминаю, что оценивать <important>репрезентативность выборки</important> мы пока не беремся, но скоро к этому перейдем.",
        "level_4": "Всё верно, всего у слизней есть 4 признака:\n1. цвет;\n2. тип;\n3. сладкость;\n4. слизкость.\nВажно понимать, что имя — не признак. Это, скорее, идентификатор.",
        "level_5": "Верный выбор. <important>Категориальных</important> признаков у слизней 2: цвет и тип.",
        "level_6": "Верно. <important>Количественных</important> признаков у слизней тоже 2: слизкость и сладкость.",
        "level_7": "Если признак принимает <important>экстремальные значения</important>, то есть аномально большие или маленькие, среднее может \"сдвигаться\" в их сторону и его использовать не стоит.",
        "level_8": "На практике стоит сразу считать и медиану, и среднее, чтобы лучше понять как устроен признак.",
        "level_9": "Моду можно считать и у <important>количественных</important> признаков!",
        "level_10": "10"
    },
    "PythonHint": {
        "level_1": "Привет. Я буду давать тебе советы по <code>python</code>, то есть как работать со статистикой в нём. Первым делом установи <code>numpy</code>.",
        "level_2": "Напоминаю, что я буду давать тебе советы по <code>python</code> и <code>numpy</code>. Предположим, что выборка представлена массивом — узнать её размер можно с помощью атрибута <code>size</code>.",
        "level_3": "Напоминаю, что я буду давать тебе советы по <code>python</code> и <code>numpy</code>. Предположим, что выборка представлена массивом — узнать её размер можно с помощью атрибута <code>size</code>.",
        "level_4": "Существует библиотека <code>pandas</code>, которая позволяет работать с табличным представлением данных <code>dataframe</code> в <code>python</code>. Чаще всего количество колонок <code>dataframe</code> равняется числу признаков: <code>len(df.columns)</code>.",
        "level_5": "Работать с категориальными признаками просто так нельзя, их необходимо \"закодировать\", например, через <code>label, one-hot</code> или <code>target encoder</code>.",
        "level_6": "Если вызвать метод <code>describe</code> у <code>df</code>: <code>df.describe()</code>, то можно получить описание каждого количественного признака!",
        "level_7": "Предположим, что значения количественного признака собраны в массив. К нему можно применить функцию, чтобы узнать среднее: <code>arr.mean()</code>.",
        "level_8": "Предположим, что значения количественного признака собраны в массив. В таком случае, чтобы вычислить его медиану воспользуем функцией: <code>np.median(arr)</code>.",
        "level_9": "К сожалению, просто так моду не посчитать. Для начала надо посчитать сколько раз каждое значение встречается, а далее выбрать максимальное: <code>val, c = np.unique(x, return_counts=True), mode = np.argwhere(c == np.max(c))</code>.",
        "level_10": ""
    },
    "TableHint": {
        "level_1": "Приветсвую! Ко мне ты можешь обращаться, чтобы узнать полезные функции <table>Excel</table> или <table>Google Sheets</table>.",
        "level_2": "Напоминаю, что я буду давать тебе советы по <table>Excel</table> или <table>Google Sheets</table>. Для того, чтобы посчитать количество элементов есть функция <table>=СЧЁТ()</table>.",
        "level_3": "Напоминаю, что я буду давать тебе советы по <table>Excel</table> или <table>Google Sheets</table>. Для того, чтобы посчитать количество элементов есть функция <table>=СЧЁТ()</table>.",
        "level_4": "Специфичной функции у таблиц нет, но всё просто! Чаще всего колонки в таблице — это признаки, сл-но количество признаков совпадает с их числом.",
        "level_5": "Специфичной функции у таблиц нет, но всё легко! Всё текстовое — это категориальные признаки.",
        "level_6": "Специфичной функции у таблиц нет, но всё элементарно! Всё численное — это количественные признаки.",
        "level_7": "Для поиска среднего значения количественного признака можно воспользоваться функцией <table>=СРЗНАЧ()</table>.",
        "level_8": "Для поиска медианы количественного признака можно воспользоваться функцией <table>=МЕДИАНА()</table>.",
        "level_9": "Для поиска моды признака можно воспользоваться функцией <table>=МОДА()</table>.",
        "level_10": ""
    },
    "ArenaTask": {
        "level_1": "Найди объем выборки",
        "level_2": "Найди среднее сладкости",
        "level_3": "Найди среднее слизкости",
        "level_4": "Найди медиану сладкости",
        "level_5": "Найди моду слизкости",
        "level_6": "",
        "level_7": "",
        "level_8": "",
        "level_9": "",
        "level_10": ""
    },
    "UI": {
        "empty": "error",
        "btn_play": "площадка",
        "btn_battle": "арена",
        "btn_exit": "выйти",
        "btn_change_language": "English",
        "btn_reset_progress": "сбросить прогресс",
        "hint_full": "слизней больше нет...",
        "hint_deactivate": "слизь не пролезает...",
        "hint_click_to_close": "нажми, чтобы закрыть",
        "hint_well": "добавляй или убирай слизней",
        "hint_dyer": "крась слизней",
        "hint_modifier_sweetness": "изменяет сладкость слизня",
        "hint_modifier_slipperiness": "изменяет слизкость слизня",
        "slime_slipperiness": "слизкость:",
        "slime_sweetness": "сладкость:",
        "slime_type": "тип:",
        "slime_type_domestic": "домашний",
        "slime_type_wild": "дикий",
        "arena_description": "<important>Арена</important> — место, в котором ты можешь проверить свои силы. Это больше не площадка, тут с данными играться не получится. <warning>Теперь всё как в реальной жизни</warning>. Есть <important>выборка</important>, по ней требуется <important>что-то найти</important>. \n\nЗа каждый неправильный ответ ты будешь терять <warning>здоровье</warning>. Когда оно опустится до нуля, то… всё.",
        "arena_answer": "ответ...",
        "python_master": "Python Мастер",
        "tables_master": "Мастер по Таблицам",
        "grandpa": "Дедушка"
    }
}