{
    "LevelTask": {
        "level_1": "Попробуй собрать генеральную совокупность слизней",
        "level_2": "Собери максимальную выборку слизней",
        "level_3": "Минимизируй выборку",
        "level_4": "Оставь слизней того цвета, количество которых совпадает с числом признаков",
        "level_5": "Оставь слайма с уникальными значениями категориальных признаков",
        "level_6": "Оставь слайма с максимальной сумму количественных признаков",
        "level_7": "Сделай так, чтобы среднее слизкости было 15",
        "level_8": "Сделай так, чтобы среднее и медиана слизкости совпадали",
        "level_9": "",
        "level_10": ""
    },
    "LevelTheory": {
        "level_1": "Привет! Давай вспомним, что такое математическая статистика. Это раздел математики, изучающий результаты наблюдения массовых случайных явлений. Например, <important>появление слизней</important> — такое явление. Все слизни вместе образуют <important>генеральную совокупность</important>! Эта такая совокупность, относительно которой мы будем делать вывод. Давай попробуем собрать её.",
        "level_2": "Как ты мог догадаться, мы не собрали <important>генеральную совокупность<important>. Она <important>слишком большая<important>. Вместо этого давай соберем <important>выборку<important>. Часть <important>генеральной совокупности<important>, отобранная для изучения, называется <important>выборочная совокупность<important>.",
        "level_3": "<important>Объем выборки</important> стараются максимизировать, чтобы увеличить её <important>репрезентативность</important>, то есть, как она отображает <important>генеральную совокупность</important>. Однако на ферме я разрешаю тебя уменьшать выборку, но <warning>нигде и никогда больше так не делай</warning>!",
        "level_4": "У объектов есть <important>признаки</important>. Это результаты измерения некоторой <important>характеристики</important> объекта.",
        "level_5": "<important>Признаки</important> бывают разных типов. Если множество значений признака конечно, то говорят, что он <important>категориальный</important>. Например, множество имён слизней конечно, поэтому имя — категориальный признак.",
        "level_6": "Другой тип признака — <important>количественный</important>. В статистике чаще приходится сталкиваться именно с такими признаками, чем с <important>категориальными</important>. Он принимает любое значение числовой оси.",
        "level_7": "У признаков есть огромное число разных <important>характеристик</important>, например, <important>выборочное среднее</important>. Это просто среднее арифметическое значение <important>количественного</important> признака выборки. Давай поиграемся с данными, чтобы посмотреть, как меняется среднее. <warning>Нигде больше так не делай!</warning>",
        "level_8": "Продолжим разбираться с <important>характеристиками</important>. Предположим, что признак принимает <important>экстремальные значения</important>. В таком случае среднее может \"сдвигаться\" в их сторону. Тут на помощь и приходит <important>медиана</important>. \n\nМедиана равняется <important>середине упорядоченного ряда</important> (или на полусумму значений середины, если объем выборки четный). Иногда медиана и среднее могут совпадать. Давай попробуем так сделать! <warning>но больше нигде так не делай!</warning>",
        "level_9": "",
        "level_10": ""
    },
    "LevelCompleted": {
        "level_1": "1",
        "level_2": "2",
        "level_3": "3",
        "level_4": "4",
        "level_5": "5",
        "level_6": "6",
        "level_7": "7",
        "level_8": "8",
        "level_9": "9",
        "level_10": "10"
    },
    "PythonHint": {
        "level_1": "Привет. Я буду давать тебе советы по <code>python</code>, то есть как работать со статистикой в нём. Первым делом установи <code>numpy</code>.",
        "level_2": "Напоминаю, что я буду давать тебе советы по <code>python</code>. Предположим, что выборка представлена массивом — узнать её размер можно с помощью атрибута <code>size</code>.",
        "level_3": "Если надо найти мощность множества категориального признака, то проще всего обернуть массив данных в множество и найти его длину: <code>len(set(arr))</code>",
        "level_4": "Предположим, что значения количественного признака собраны в массив. К нему можно применить функцию, чтобы узнать среднее: <code>arr.mean()</code>",
        "level_5": "Предположим, что значения количественного признака собраны в массив. В таком случае, чтобы вычислить его медиану воспользуем функцией: <code>np.median(arr)</code>",
        "level_6": "",
        "level_7": "",
        "level_8": "",
        "level_9": "",
        "level_10": ""
    },
    "TableHint": {
        "level_1": "Приветсвую! Ко мне ты можешь обращаться, чтобы узнать полезные функции <table>Excel</table> или <table>Google Sheets</table>.",
        "level_2": "Напоминаю, что я буду давать тебе советы по <table>Excel</table> или <table>Google Sheets</table>. Для того, чтобы посчитать количество элементов есть функция <table>=СЧЁТ()</table>",
        "level_3": "Для поиска мощности множества категориального признака можно воспользоваться функцией <table>=UNIQUE()</table>",
        "level_4": "Для поиска среднего значения количественного признака можно воспользоваться функцией <table>=СРЗНАЧ()</table>",
        "level_5": "Для поиска медианы количественного признака можно воспользоваться функцией <table>=МЕДИАНА()</table>",
        "level_6": "",
        "level_7": "",
        "level_8": "",
        "level_9": "",
        "level_10": ""
    },
    "ArenaTask": {
        "level_1": "Найди объем выборки",
        "level_2": "Найди среднее сладкости",
        "level_3": "Найди среднее слизкости",
        "level_4": "Найди медиану сладкости",
        "level_5": "Найди моду слизкости"
    },
    "UI": {
        "empty": "error",
        "btn_play": "играть",
        "btn_battle": "арена",
        "btn_exit": "выйти",
        "btn_change_language": "English",
        "btn_reset_progress": "сбросить прогресс",
        "hint_full": "слаймов больше нет...",
        "hint_deactivate": "слайм не пролезает...",
        "hint_click_to_close": "нажми, чтобы закрыть",
        "hint_well": "добавляй или убирай слаймов",
        "hint_dyer": "крась слаймов",
        "hint_modifier_sweetness": "изменяет сладкость слайма",
        "hint_modifier_slipperiness": "изменяет слизкость слайма",
        "slime_slipperiness": "слизкость: {0}",
        "slime_sweetness": "сладкость: {0}",
        "arena_description": "<important>Арена</important> — место, в котором ты можешь проверить свои силы. Это больше не площадка, тут с данными играться не получится. <warning>Теперь всё как в реальной жизни</warning>. Есть <important>выборка</important>, по ней требуется <important>что-то найти</important>. \n\nЗа каждый неправильный ответ ты будешь терять <warning>здоровье</warning>. Когда оно опустится до нуля, то… всё.",
        "arena_answer": "ответ...",
        "python_master": "Python Мастер",
        "tables_master": "Мастер по Таблицам",
        "grandpa": "Дедушка"
    }
}