{
    "LevelTask": {
        "level_1": "Собери максимальную выборку слизней",
        "level_2": "Минимизируй выборку",
        "level_3": "Мощности множеств категориальных признаков должны быть равны",
        "level_4": "Среднее слизкости должно быть 15",
        "level_5": "Среднее и медиана слизкости должны совпадать"
    },
    "LevelTheory": {
        "level_1": "Привет! Давай вспомним, что такое математическая статистика. Это раздел математики, изучающий результаты наблюдения массовых случайных явлений. Например, <important>появление слизней</important> — такое явление. Все слизни вместе образуют <important>генеральную совокупность</important>, а часть, отобранная для изучения, является <important>выборочной совокупностью</important> (выборкой).\n\nМы не можем исследовать всех-всех существующих слизней, а часть - вполне. Давай призовем как можно большой слизней, чтобы максимизировать <important>объем</important> выборки, то есть число объектов совокупности!",
        "level_2": "<important>Объем выборки</important> стараются максимизировать, чтобы увеличить её <important>репрезентативность</important>, то есть, как она отображает <important>генеральную совокупность</important>. Однако на ферме я разрешаю тебя уменьшать выборку, но <warning>нигде и никогда больше так не делай</warning>! \n\nБолее того, в дальнейшем мы будем вносить изменения в наши объекты, то есть манипулировать слизнями. <warning>С реальными объектами так делать нельзя!</warning>",
        "level_3": "У объектов есть <important>признаки</important>. Это результаты измерения некоторой <important>характеристики</important> объекта. Если множество значений признака конечно, то говорят, что он <important>категориальный</important>. Например, множество имён слизней конечно, поэтому имя — категориальный признак. \n\nДавай внесем небольшим изменения в нашу выборку, но напоминаю, что <warning>так можно делать только на ферме</warning>. \n\nNB. <important>Мощность множества</important> — количество элементов этого множества.",
        "level_4": "Другой тип признака — <important>количественный</important>. В статистике чаще приходится сталкиваться именно с такими признаками, чем с <important>категориальными</important>. Он принимает любое значение числовой оси.\n\nУ количественных признаков есть огромное число разных <important>характеристик</important>, например, <important>выборочное среднее</important>. Это просто среднее арифметическое значение признака выборки. Давай поиграемся с данными, чтобы посмотреть, как меняется среднее. <warning>Нигде больше так не делай</warning>.",
        "level_5": "Продолжим разбираться с характеристиками <important>количественных</important> признаков. Предположим, что признак может принимать <important>экстремальные значения</important>. В таком случае среднее может \"сдвигаться\" в их сторону, и чтобы избежать такого, можно воспользоваться <important>медианой</important>. \n\nМедиана приходится на <important>середину ряда</important> (или на полусумму значений середины, если объем выборки четный), если расположить значения в порядке возрастания (убывания). Иногда медиана и среднее могут совпадать. Давай попробуем так сделать! <warning>но больше нигде так не делай!</warning>"
    },
    "PythonHint": {
        "level_1": "Привет. Я буду давать тебе советы по <code>python</code>, то есть как работать со статистикой в нём. Первым делом установи <code>numpy</code>.",
        "level_2": "Напоминаю, что я буду давать тебе советы по <code>python</code>. Предположим, что выборка представлена массивом — узнать её размер можно с помощью атрибута <code>size</code>.",
        "level_3": "Если надо найти мощность множества категориального признака, то проще всего обернуть массив данных в множество и найти его длину: <code>len(set(arr))</code>",
        "level_4": "Предположим, что значения количественного признака собраны в массив. К нему можно применить функцию, чтобы узнать среднее: <code>arr.mean()</code>",
        "level_5": "Предположим, что значения количественного признака собраны в массив. В таком случае, чтобы вычислить его медиану воспользуем функцией: <code>np.median(arr)</code>"
    },
    "TableHint": {
        "level_1": "Приветсвую! Ко мне ты можешь обращаться, чтобы узнать полезные функции <table>Excel</table> или <table>Google Sheets</table>.",
        "level_2": "Напоминаю, что я буду давать тебе советы по <table>Excel</table> или <table>Google Sheets</table>. Для того, чтобы посчитать количество элементов есть функция <table>=СЧЁТ()</table>",
        "level_3": "Для поиска мощности множества категориального признака можно воспользоваться функцией <table>=UNIQUE()</table>",
        "level_4": "Для поиска среднего значения количественного признака можно воспользоваться функцией <table>=СРЗНАЧ()</table>",
        "level_5": "Для поиска медианы количественного признака можно воспользоваться функцией <table>=МЕДИАНА()</table>"
    },
    "ArenaTask": {
        "level_1": "Найди объем выборки",
        "level_2": "Найди среднее сладкости",
        "level_3": "Найди среднее слизкости",
        "level_4": "Найди медиану сладкости",
        "level_5": "Найди моду слизкости"
    },
    "UI": {
        "empty": "error",
        "btn_play": "играть",
        "btn_battle": "арена",
        "btn_exit": "выйти",
        "btn_change_language": "English",
        "btn_reset_progress": "сбросить прогресс",
        "hint_full": "больше нет...",
        "hint_deactivate": "не пролезает...",
        "hint_click_to_close": "нажми, чтобы закрыть",
        "slime_slipperiness": "слизкость: {0}",
        "slime_sweetness": "сладкость: {0}",
        "arena_description": "<important>Арена</important> — место, в котором ты можешь проверить свои силы. Это больше не площадка, тут с данными играться не получится. <warning>Теперь всё как в реальной жизни</warning>. Есть <important>выборка</important>, по ней требуется <important>что-то найти</important>. \n\nЗа каждый неправильный ответ ты будешь терять <warning>здоровье</warning>. Когда оно опустится до нуля, то… всё.",
        "arena_answer": "ответ..."
    }
}